{
	"postId": "131484",
	"title": "06-17-2025 Update",
	"author": "Yoshi",
	"authorImage": "https://project8-data.community.forum/avatars/m/0/1.jpg?1713628630",
	"pubDate": "2025-06-17T13:34:00-0700",
	"content": "<div class=\"message-userContent lbContainer js-lbContainer \">\n\n\t\t\n\t\t\t\n\n\t\n\t\t\n\t\n\n\t\t\n\n\t\t<article>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t<div>\n\t\t\t\t\n\t\t\t\t\t<div class=\"bbWrapper\"><b>[ Map Changes ]</b><br>\n<br>\nMid Lane Rework (between Guardians):<br>\n- Removed the Arch Monument.<br>\n- Removed the rope entrances to Mid Boss.<br>\n- Removed barrels and kiosk low cover.<br>\n- Replaced bridge with a larger version.<br>\n- Added stairway entrance to Mid Boss.<br>\n- Moved the veil areas to fit with the new bridge.<br>\n- Veil areas connect to Mid Boss.<br>\n- Extended the wall cover further toward the bridge.<br>\n<br>\nMid Boss Changes:<br>\n- Started Mid Boss Sewer theming.<br>\n- Added connection from the rope shafts to upper area of Mid Boss.<br>\n- Increase height of entrances to rope shafts from Mid Boss.<br>\n- Added sloped mounds on side of stairs from the pit.<br>\n<br>\n<br>\n- Adjusted breakables that were spread out in the underground<br>\n<br>\n<br>\n<br>\n<b>[ Gameplay Changes ]</b><br>\n<br>\n- Flex Slot changed from \"Two Guardians\" to \"Three Guardians\"<br>\n- Flex Slot changed from \"Two Walker\" to \"Three Walkers\"<br>\n<br>\n- Guardian and Walker total bounty is now split with all nearby players (including players that have done damage to it within 20s). Nearby players get 40% and the rest is split evenly with all 6 players (including those nearby).<br>\n- Trooper damage to Walkers reduced from 80 DPS to 60 DPS<br>\n<br>\n- Hero Kill bounty increased from 250-&gt;1800 to 300-&gt;2000 (over 40 minutes, previously over 45 minutes)<br>\n- Killing heroes no longer spawns orbs, instead the souls are directly awarded to the killer and assisters<br>\n- Destroying objectives no longer spawns orbs, instead the souls are directly awarded to the killer and their team<br>\n- Trooper base bounty reduced from 132 to 120<br>\n- Trooper bounty growth per minute increased from 1 to 1.5<br>\n<br>\n- Time holding Urn before taking damage reduced from 90s to 45s (1% max health damage per second)<br>\n- Time Urn will Autorun back to Home regardless of nearby players reduced from 75s to 45s<br>\n- Time an Urn will wait for a nearby player to pick it up reduced from 20s to 12s<br>\n<br>\n- Cleaned up how boons are distributed. Previously some levels gave stat bonuses and some AP/Unlocks, now every level gives one of each. Power rebalanced on abilities and items to be the same overall as before. Total AP given out reduced from 32 to 29, total stat levels increased from 20 to 32 (but rescaled in value such that they are the same overall as before).<br>\n<br>\n- Walker HP increased by 10%<br>\n- Walker Spirit Resist reduced from 40% to 30%<br>\n<br>\n- Soul Orb auto claim radius reduced from 40m to 35m<br>\n- Headshot multiplier reduced from 1.9x to 1.8x<br>\n- Fixed some issues with hitting troopers while on ziplines<br>\n- Fix potential prediction issue on guns, causing clients' spread to potentially decay faster<br>\n<br>\n- Rejuv drop duration reduced from 9s to 8s<br>\n<br>\n- Opening Rounds: No longer works against objectives<br>\n- Extra Regen: Regen reduced from 3.5 to 3<br>\n- Healing Booster: Regen reduced from 3.5 to 3<br>\n- Enchanter's Emblem: Spirit Resistance reduced from 18% to 15%<br>\n- Fortitude: Damage taken cooldown increased from 12s to 14s<br>\n- Bullet Resilience: Health threshold for bonus resistance reduced from 35% to 30%<br>\n- Spirit Resilience: Health threshold for bonus resistance reduced from 35% to 30%<br>\n- Rescue Beam: Cooldown increased from 30s to 60s<br>\n- Radiant Regeneration: Regen reduced from 5 HP to 4<br>\n- Radiant Regeneration: Healing on ability cast reduced from 100 to 70<br>\n- Radiant Regeneration: Healing on ability cast now scales with Boons (1.5)<br>\n- Tankbuster only goes on cooldown when it affects players (no longer goes on cooldown if an ability hits a trooper)<br>\n- Superior Cooldown: Cooldown Reduction reduced from 25% to 24%<br>\n<br>\n<br>\n- Calico: Ava no longer automatically breaks boxes, instead you can use the melee hotkey to do a pounce attack to break them<br>\n- Calico: Base Health reduced from 700 to 650<br>\n- Calico: Base Health Growth reduced by 13%<br>\n- Calico: Leaping Slash melee multiplier has been reduced from 1.6 to 1.3<br>\n- Calico: Return to Shadows T3 reduced from +30% Amp to +24%<br>\n- Kelvin Arctic Beam cooldown increased from 24s to 25s<br>\n- Kelvin: Arctic Beam T1 reduced from -7.5s Cooldown to -7s<br>\n- Kelvin: Arctic Beam T3 range reduced from 13m to 10m<br>\n- Lady Geist: Base bullet damage reduced from 26 to 23<br>\n- Lady Geist: Life Drain self slow increased from 25% to 40%<br>\n- Lady Geist: Soul Exchange cast range reduced from 7m to 6m<br>\n- Viscous: Goo Ball hitbox size increased a bit (easier to hit him)<br>\n- Viscous: Splatter second bounce damage has been reduced from 70% damage to 50% damage. Damage is now 100%, 50%, 50% for first, second and third hit.<br>\n- Viscous: Goo Ball damage reduced from 140 to 120<br>\n- Warden: Last Stand no longer gets reduced cooldown when interrupted<br>\n- Warden: Last Stand DPS reduced from 90 to 80<br>\n- Warden: Last Stand T2 DPS reduced from +60 to +50<br>\n- Warden: Last Stand spirit scaling increased from 1.4 to 1.6<br>\n- Wraith: Base health reduced from 700 to 650<br>\n- Wraith: Bullet damage growth reduced by 18%<br>\n- Wraith: Card Trick damage reduced from 70 to 60<br>\n- Wraith: Card Trick spirit scaling increased from 0.84 to 1.1<br>\n- Wraith: Card Trick T3 now also applies a 25% Slow for 1s<br>\n- Wraith: Full Auto T2 reduced from 4 Spirit Damage to 3<br>\n- Wraith: Project Mind improved teleport targeting to remove cases where Wraith would clip nearby geo unintentionally</div>\n\t\t\t\t\n\t\t\t</div>\n\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t</article>\n\n\t\t\n\t\t\t\n\n\t\n\t\t\n\t\n\n\t\t\n\n\t\t\n\t</div>",
	"posterReplies": []
}
