{
	"postId": "126706",
	"title": "05-21-2025 Update",
	"author": "Yoshi",
	"authorImage": "https://project8-data.community.forum/avatars/m/0/1.jpg?1713628630",
	"pubDate": "2025-05-21T15:55:33-0700",
	"content": "<div class=\"message-userContent lbContainer js-lbContainer \">\n\n\t\t\n\t\t\t\n\n\t\n\t\t\n\t\n\n\t\t\n\n\t\t<article>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t<div>\n\t\t\t\t\n\t\t\t\t\t<div class=\"bbWrapper\">[ General ]<br>\n<br>\n- Troopers will now only flinch from player damage if it is a headshot while the trooper is busy running.<br>\n- Trooper resistance near base reduced from 50% to 40%<br>\n- Fixed Breakable souls being counted as secured souls rather than unsecured souls (this fix was released yesterday)<br>\n- Added Breakable souls to the post game Souls by Source graph (was previously bundled in with Urn)<br>\n- Melee damage growth per boon reduced by 5%<br>\n<br>\n- Express Shot: Weapon Damage increased from 125% to 150%<br>\n- Express Shot: Now does reduced damage for non-primary gun damage (alt fires, carbine), 150% to 75%<br>\n- Headshot Booster: Health reduced from 65 to 40<br>\n- Headhunter: Heal reduced from 6% to 4%<br>\n- Headhunter: Heal now scales with spirit power (0.014)<br>\n- Headhunter: Bonus damage reduced from 120 to 100<br>\n- Headhunter: Bonus damage now scales with spirit power (0.3)<br>\n- Cultists Sacrifice: Bonus health reduced from 275 to 250<br>\n- Cultists Sacrifice: Bonus duration reduced from 170s to 160s<br>\n- Spirit Rend: Fixed being able to get 2 stacks without using the cooldown<br>\n- Frenzy: Active Spirit Resistance reduced from 40% to 30%<br>\n- Siphon Bullets: Steal per hit reduced from 65 to 55<br>\n- Siphon Bullets: Spirit Resistance reduced from 12% to 10%<br>\n- Siphon Bullets: Fixed the cooldown not being consumed when blocked by Plated Armor<br>\n- Decay: Cast range spirit scaling reduced from 0.13 to 0.1<br>\n- Decay: Damage reduced from 2.5% to 2.4%<br>\n- Decay: Damage spirit scaling reduced from 0.00465 to 0.0038<br>\n- Decay: Cooldown increased from 30s to 36s<br>\n- Decay: Healing Reduction increased from -35% to -40%<br>\n- Superior Cooldown: Cooldown Reduction reduced from 27% to 26%<br>\n<br>\n<br>\n[ Map ]<br>\n<br>\nBase:<br>\n- Added statues in front of Mid Lane entrances for cover.<br>\n- Moved Shrines away from the back walls a bit.<br>\n- Extended shrine low ground closer to the throne.<br>\n- Redesigned cover in front of the throne.<br>\n- Removed a tree in front of the Mid Lane entrance.<br>\n- Tweaked trooper nodes to go around new statues.<br>\n<br>\nBug Fixes:<br>\n- Removed a misplaced Curiosity Shop sign.</div>\n\t\t\t\t\n\t\t\t</div>\n\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t</article>\n\n\t\t\n\t\t\t\n\n\t\n\t\t\n\t\n\n\t\t\n\n\t\t\n\t</div>",
	"posterReplies": []
}
