{
	"postId": "159109",
	"title": "10-02-2025 Update",
	"author": "Yoshi",
	"authorImage": "https://project8-data.community.forum/avatars/m/0/1.jpg?1713628630",
	"pubDate": "2025-10-02T13:03:05-0700",
	"content": "<div class=\"message-userContent lbContainer js-lbContainer \">\n\n\t\t\n\t\t\t\n\n\t\n\t\t\n\t\n\n\t\t\n\n\t\t<article>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t<div>\n\t\t\t\t\n\t\t\t\t\t<div class=\"bbWrapper\"><b>[ General ]</b><br>\n<br>\n* Weapon Investment bonus increased from 7/9/13/20/29/40/58/72/83/93% to 7/9/13/20/29/40/60/75/95/115 (for 0.8/1.6/2.4/3.2/4.8/7.2/9.6/16/22.4/28.8k spent)<br>\n<br>\n* Applying a CC to an enemy is reduced in duration when affected by other CCs in a short interval. Each previously applied CC reduces the duration by 7% up to a max of 21% over the past 7 seconds. CC is defined as the same set of debuffs that affect Reactive Barrier (stun, sleep, immobilize, tether, etc). Note that abilities that apply multiple things only count as one CC (aka Abrams shoulder charge CC on the grab and the stun, Lash ult grab and stun, etc).<br>\n<br>\n* Matchmaking updates to include more considerations for a balanced roster beyond only frontliners<br>\n<br>\n* Reduced shooting lock-out period when jumping from 0.15s to 0.0s<br>\n* Shooting while jumping now applies a -10% inaccuracy period for 0.15s after jumping<br>\n<br>\n* Wall Jumps after the first one now cost 0.5 stamina (first wall jump per sequence is free)<br>\n* Reduced corner boosting velocity by 20%<br>\n<br>\n* Mid Boss base HP increased from 12500 to 13000<br>\n* Mid Boss damage resistance per second reduced from 50 + 7/min to 35 + 5/min<br>\n* Rejuv bonus HP reduced from 15% to 10%<br>\n* 2nd Midboss rejuv credits reduced from 4 to 3<br>\n<br>\n* Dropped Unsecured soul bags now require a Heavy Melee to secure rather than standing ontop of them<br>\n<br>\n* Soul Urn: Carriers now have +30% bullet and +30% spirit Resist<br>\n* Soul Urn: Movespeed bonus reduced from +7m to +3.5m<br>\n* Soul Urn: Damage taken when holding too long increased from 1% to 1.5% Max Health per second<br>\n<br>\n* Added an extra boon at 12k (nearby boon levels adjusted slightly, 10.2/11.6/13.2k to 10/11/12/13.2k)<br>\n<br>\n* Neutral Shop no longer gets disabled if an enemy is nearby<br>\n* Distance to attack Walkers reduced from 35m to 34m<br>\n* Fixed ordering issues with various items with Bullet based Procs. Debuffs (ie. negative Bullet Resist) from all procs are now applied before any bonus damage from the procs. Items include Weakening Headshot, Crippling Headshot, Headshot Booster, Headhunter, Hollow Point and Mystic Shot.<br>\n* Enabled input buffering for shooting, dashing, melee and parry. This allows input to register before the current action is finished<br>\n<br>\n<br>\n<br>\n<br>\n<b>[ Heroes ]</b><br>\n<br>\n* Abrams: Siphon Life damage and spirit scaling reduced by 10%<br>\n* Abrams: Siphon Life heal ratio increased by 10%<br>\n* Abrams: Shoulder Charge T1 changed from +25% Weapon Power to +20 Bullet Damage Per Shot (results in a weaker followup melee hit)<br>\n<br>\n* Billy: Add footsteps to Billy's out of combat run animations<br>\n* Billy: Base move speed reduced from 7.3 to 7.1<br>\n* Billy: Blasted T1 movespeed increased from +1.75 to +2.25m<br>\n<br>\n* Calico: Base bullet damage increased from 1.9 to 2.0<br>\n* Calico: Gloom Bombs radius increased from 2.5m to 3m<br>\n* Calico: Ava duration increased from 14s to 16s<br>\n* Calico: Leaping Slash height increased from 1.5m to 2.5m<br>\n* Calico: Return to Shadows cooldown reduced from 100s to 90s<br>\n* Calico: Return to Shadows radius increased from 7m to 7.5m<br>\n<br>\n* Doorman: Doorway placement has been improved<br>\n* Doorman: Doorway can now be placed through veils again<br>\n* Doorman: Improved performance when placing Doorway<br>\n<br>\n* Drifter: Stalker's Mark new sound added for teleport precast<br>\n* Drifter: Stalker's Mark replaced temp whizby sound with an updated version<br>\n* Drifter: Stalker's Mark ambush cast delay increased from 0.0s to 0.35s<br>\n<br>\n* Dynamo: Kinetic Pulse height increased from 0.7m to 1.0m<br>\n* Dynamo: Rejuvenating Aurora spirit scaling per level increased from 0.372 to 0.4<br>\n<br>\n* Grey Talon: Charged Shot spirit scaling reduced from 1.11 to 1.0<br>\n* Grey Talon: Charged Shot T3 spirit scaling reduced from 1.11 to 1.0<br>\n* Grey Talon: Rain of Arrows no longer lingers the air benefits like unlimited air dash once the ability is canceled or runs out<br>\n<br>\n* Ivy: Bullet damage growth reduced from 0.15 to 0.11<br>\n* Ivy: Spirit scaling per boon increased from 1.1 to 1.2<br>\n* Ivy: Kudzu Bomb DPS reduced from 55 to 50<br>\n* Ivy: Kudzu Bomb T3 DPS reduced from +46 to +40<br>\n* Ivy: Stone Form damage spirit scaling increased from 1.0 to 1.5<br>\n* Ivy: Air Drop no longer grants allied bullet resistance (still grants barrier on drop)<br>\n<br>\n* Kelvin: Base bullet damage reduced from 18.9 to 17.8<br>\n* Kelvin: Clip size reduced from 15 to 14<br>\n* Kelvin: Spirit Power per boon increased from 1.1 to 1.3<br>\n<br>\n* Lady Geist: Essence Bomb spirit scaling increased from 1.07 to 1.22<br>\n<br>\n* Lash: Ground Strike range reduced from 11m to 10m<br>\n* Lash: Ground Strike cooldown increased from 19s to 21s<br>\n* Lash: Ground Strike damage reduced from 70 to 60<br>\n<br>\n* Mina: New heavy melee animation<br>\n* Mina: Rake now passively lets you float in the air with the umbrella for up to 2.5s with right click<br>\n* Mina: Rake heal spirit scale reduced from 1.5 to 0.5<br>\n* Mina: Rake T2 now also increases heal spirit scale by 1.0<br>\n* Mina: Rake T3 damage increased from 6% to 7%<br>\n* Mina: Sanguine Retreat cooldown increased from 27s to 30s<br>\n* Mina: Nox Nostra now has 50% reduction in damage against objectives<br>\n* Mina: Nox Nostra reduced the Cap on objective damage from the T3 from +50 Damage per Bat to +20 Damage (only a nerf against objectives)<br>\n<br>\n* Mirage: Djinn's Mark is now affected by cooldown reduction<br>\n<br>\n* Mo &amp; Krill: Bullet damage growth per boon increased from 0.063 to 0.07<br>\n* Mo &amp; Krill: Burrow bullet resistance reduced from 80% to 60%<br>\n* Mo &amp; Krill: Combo duration reduced from 2.5s to 2.4s<br>\n* Mo &amp; Krill: Combo T2 duration reduced from 0.75s to 0.7s<br>\n<br>\n* Paige: Bullet projectile speed increased by 15%<br>\n* Paige: Bullet damage growth per boon reduced from 0.8 to 0.66<br>\n* Paige: Defend and Fight! duration increased from 5s to 7s<br>\n* Paige: Defend and Fight! cooldown increased from 26s to 30s<br>\n* Paige: Captivating Read reduced cooldown from 30s to 25s<br>\n* Paige: Captivating Read moved the UI element to the bottom of the screen so it's more noticeable when you get hit<br>\n* Paige: Captivating Read radius increased from 7m to 7.5m<br>\n* Paige: Conjure Dragon now properly applies burning effect below the dragon if the dragon is far off the ground<br>\n* Paige: Rallying Charge damage reduced from 150 (+1.2) to 125 (+1.0)<br>\n* Paige: Rallying Charge healing reduced from 150 (+2) to 125 (+1.6)<br>\n* Paige: Rallying Charge both damage &amp; healing now grows as the horses travel, up to a max +100% of both at 350m<br>\n* Paige: Rallying Charge increased horse speed from 1700 to 2000<br>\n* Paige: Rallying Charge reduced knock-up speed from 800 to 600<br>\n* Paige: Rallying Charge spawn-in time reduced from 0.15s to 0.05s to remove deadzone in front<br>\n<br>\n* Seven: Static Charge T2 reduced from +8m to +7m<br>\n* Seven: Power Surge spirit power scaling reduced by 10%<br>\n* Seven: Storm Cloud’s Lightning Strike damage reduced from 90 to 75<br>\n* Seven: Storm Cloud’s Lightning Strike spirit power reduced from 1.4 to 0.5<br>\n<br>\n* Victor: Base health changed from 680 (+41 per boon, max of 1992) to 720 (+39 per boon, max of 1968)<br>\n* Victor: Pain Battery fixed the bolts hitting world geometry more often than intended<br>\n* Victor: Pain Battery damage required to charge up reduced from 50% max health to 40%<br>\n* Victor: Aura of Suffering reduced DPS spirit scaling on the minimum damage from 0.25 to 0.22 and on the maximum damage from 1.25 to 1.1<br>\n* Victor: Aura of Suffering self damage reduced from 100% to 85%<br>\n* Victor: Shocking Reanimation increased stun duration from 1s to 1.5s<br>\n* Victor: Shocking Reanimation damage spirit scaling increased from 1.8 to 2.0<br>\n* Victor: Shocking Reanimation T1 changed from \"+10 spirit damage per bullet and 25% fire rate until reload\" to \"<br>\n+3m Radius and +100 Damage\"<br>\n* Victor: Shocking Reanimation T3 changed from \"+200 damage and +3m radius\" to \"+10 spirit damage per bullet and 20% fire rate while the ability is on cooldown\"<br>\n* Victor: Shocking Reanimation improved hit detection<br>\n* Victor: Fixed Shocking Reanimation sometimes not hitting targets that are in the Z axis<br>\n<br>\n* Vindicta: Base bullet damage increased from 11.4 to 11.8<br>\n* Vindicta: Flight duration increased from 13s to 15s<br>\n* Vindicta: Flight T2 increased from 7s to 8s<br>\n* Vindicta: Flight spirit damage scaling increased from 0.19 to 0.22<br>\n* Vindicta: Assassinate bonus damage spirit scaling increased from 1.4 to 1.7<br>\n* Vindicta: Assassinate cooldown reduced from 60s to 50s<br>\n<br>\n* Viscous: Alt fire base damage reduced from 48 to 42<br>\n* Viscous: Alt fire damage growth increased from 1.25 to 1.6<br>\n* Viscous: Splatter damage reduced from 80 to 70<br>\n* Viscous: Splatter T1 increased from -5.75s to -6s<br>\n<br>\n* Vyper: Screwjab Dagger has been reworked<br>\n* Vyper: Screwjab Dagger now stacks in both damage and slows the more daggers you hit against the same target<br>\n* Vyper: Screwjab Dagger is now charge-based, with a 4.5s time between charges. Starts with 2 charges.<br>\n* Vyper: Screwjab Dagger damage changed from 50 (+1) to 50 (+0.65) and 25 (+0.33) per stack<br>\n* Vyper: Screwjab Dagger has a max stack of 3 (shows in overhead)<br>\n* Vyper: Screwjab Dagger slow changed from 50% to 35% + 15% per stack<br>\n* Vyper: Screwjab Dagger slow duration increased from 1s to 2s<br>\n* Vyper: Screwjab Dagger cooldown increased from 9s to 10s<br>\n* Vyper: Screwjab Dagger T1 changed from -4s Cooldown to +1 Charge<br>\n* Vyper: Screwjab Dagger T2 changed from +50 damage to -8% Bullet Resist, and -5% per Stack<br>\n* Vyper: Screwjab Dagger T3 changed from +2s slow duration and -1 stamina to 40% CDR on hit<br>\n* Vyper: Screwjab Dagger projectile speed increased from 3500 to 4200<br>\n* Vyper: Screwjab Dagger updated sfx<br>\n* Vyper: Screwjab Dagger added a pitch incrementor to impact sound. The sound will slightly increment in pitch relative to each stack that gets applied to a target.<br>\n* Vyper: Lethal Venom can now be cast on non-trooper enemies (neutrals and objectives)<br>\n* Vyper: Lethal Venom T3 upgrade can now trigger on all enemies, including troopers<br>\n* Vyper: Lethal Venom T3 build-up per shot reduced from 5 to 4.5 (a nerf)<br>\n* Vyper: Slither is no longer leveled up by default at the start of the game<br>\n* Vyper: Slither T3 changed from 20% resists to “180 health barrier when initiating a slide”, has 0.6 spirit scaling, lasts 5s and 8s cd.<br>\n* Vyper: Slither now leaves a green trail<br>\n<br>\n* Warden: Last Stand DPS spirit scaling reduced from 1.45 to 1.3<br>\n* Warden: Fire rate spirit scaling increased from 0.22 to 0.25<br>\n<br>\n* Wraith: Base bullet damage increased from 5.115 to 5.4<br>\n* Wraith: Bullet damage growth per boon reduced from 0.175 to 0.155<br>\n* Wraith: Card Trick delay reduced from 0.75 to 0.7<br>\n<br>\n<br>\n<br>\n<b>[ Items ]</b><br>\n<br>\n* Headshot Booster: Damage reduced from 50 to 45<br>\n* High Velocity Rounds: Bullet Velocity increased from +35% to +45% (reflected through upgrades as well)<br>\n* Backstabber: Cooldown increased from 5s to 6s<br>\n* Mystic Shot: Damage reduced from 60 to 55<br>\n* Cultist Sacrifice: Fire Rate reduced from 10% to 8%<br>\n* Cutlist Sacrifice: Fire Rate boon scaling reduced from 0.8 to 0.7<br>\n* Cultist Sacrifice: Health boon scaling reduced from 7 to 4<br>\n* Cultist Sacrifice: Health reduced from 100 to 75<br>\n* Cultist Sacrifice: Cooldown increased from 250s to 260s<br>\n* Spirit Rend: Debuff duration increased from 7s to 8s<br>\n* Spirit Rend: Cooldown reduced from 2.5s to 2.25s<br>\n* Toxic Bullets: Burn increased from 2.1% to 2.2%<br>\n* Blood Tribute: Heal reduction reduced from -40% to -30%<br>\n* Tesla Bullets: Fixed proc rate being improved with general cooldown reduction<br>\n* Capacitor: Fixed proc rate being improved with general cooldown reduction<br>\n* Shadow Weave: Spotted radius reduced from 26m to 20m<br>\n* Spiritual Overflow: No longer grants +20% Ability Duration on proc<br>\n* Spiritual Overflow: Now grants +20% Cooldown Reduction on proc<br>\n<br>\n* Extra Health: Bonus Health increased from 175 to 185<br>\n* Sprint Boots: Sprint increased from 2 to 2.25 (affects upgrades)<br>\n* Rebuttal: Now grants +18% Melee Resistance<br>\n* Spirit Lifesteal: Now provides +6 Spirit Power<br>\n* Restorative Locket: Boon scaling increased from 0.3 to 0.4<br>\n* Weapon Shielding: Damage Threshold reduced from 175 to 150<br>\n* Weapon Shielding: Movespeed increased from 1.5 to 1.75<br>\n* Spirit Shielding: Movespeed increased from 1.5 to 1.75<br>\n* Reactive Barrier: Cooldown increased from 22s to 24s<br>\n* Veil Walker: Heal reduced from 150 to 85<br>\n* Veil Walker: Heal scale per boon increased from 4 to 6<br>\n* Veil Walker: Cooldown increased from 12s to 15s<br>\n* Veil Walker: Reveal on damage duration increased from 0.25s to 0.5s<br>\n* Veil Walker: Initial invis fade duration increased from 0s to 0.25s<br>\n* Veil Walker: Reveal on spotted duration increased from 0.25s to 1.25s<br>\n* Counterspell: Parry duration reduced from 0.9s to 0.8s<br>\n* Majestic Leap: Barrier reduced from 350 to 140<br>\n* Majestic Leap: Barrier now scales with Boons (10 scaling)<br>\n* Rescue Beam: Cast range increased from 28m to 32m<br>\n* Fury Trance: Cooldown increased from 16s to 18s<br>\n* Spirit Resilience: Spirit Resistance increased from 25% to 30%<br>\n* Diviner’s Kevlar: Duration increased from 13s to 20s<br>\n* Diviner’s Kevlar: Spirit Power increased from +25 to +35<br>\n* Cheat Death: Damage output reduction reduced from -70% to -60%<br>\n* Cheat Death: Healing reduction reduced from -70% to -60%<br>\n* Inhibitor: Buildup rate increased (now matches Slowing Bullets buildup rate)<br>\n* Inhibitor: No longer limited to hero only targets<br>\n* Unstoppable: Duration increased from 5s to 5.5s<br>\n* Colossus: Active resist increased from 30% to 35%<br>\n* Colossus: Radius increased from 12m to 14m<br>\n* Spellbreaker: Threshold increased from 150 to 175<br>\n<br>\n* Rusted Barrel: Cast range increased from 28m to 32m<br>\n* Rusted Barrel: Bullet Resistance reduction increased from -6% to -8%<br>\n* Mystic Burst: Cooldown increased from 12s to 14s<br>\n* Quicksilver Reload: Bonus damage reduced from 55 to 44<br>\n* Cold Front: Bonus damage reduced from 100 to 95<br>\n* Cold Front: Cooldown increased from 24s to 25s<br>\n* Mystic Slow: Now reduces dash distance by 10% (affects upgrades)<br>\n* Disarming Hex: Cast range increased from 23m to 32m<br>\n* Silence Wave: Silence duration reduced from 3.25s to 3s<br>\n* Spirit Snatch: Melee damage reduced from 10% to 7%<br>\n* Greater Expansion: Spirit Resist increased from 8% to 10%<br>\n* Spirit Burn: Now goes on cooldown for half the normal time when used on non-heroes (rather than 0 cooldown)</div>\n\t\t\t\t\n\t\t\t</div>\n\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t</article>\n\n\t\t\n\t\t\t\n\n\t\n\t\t\n\t\n\n\t\t\n\n\t\t\n\t</div>",
	"posterReplies": [
		{
			"content": "<div class=\"message-userContent lbContainer js-lbContainer \">\n\n\t\t\n\n\t\t<article>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t<div>\n\t\t\t\t\n\t\t\t\t\t<div class=\"bbWrapper\">* Victor: Pain Battery T3 heal reduced from 20% to 18%<br>\n* Victor: Jumpstart cooldown increased from 22s to 23s<br>\n* Victor: Aura of Suffering self damage can no longer be reduced by spirit resistance (same as Jumpstart)<br>\n* Victor: Aura of Suffering self damage reduced from 85% to 80%<br>\n<br>\n* Fixed Wall Jumps not refunding stamina if a mantle or zipline occurs within the refund window (similar to how we treat other stamina refunds)</div>\n\t\t\t\t\n\t\t\t</div>\n\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t</article>\n\n\t\t\n\n\t\t\n\t</div>",
			"timestamp": "2025-10-03T13:56:48-0700"
		},
		{
			"content": "<div class=\"message-userContent lbContainer js-lbContainer \">\n\n\t\t\n\n\t\t<article>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t<div>\n\t\t\t\t\n\t\t\t\t\t<div class=\"bbWrapper\">* Victor: Aura of Suffering self damage reduced from 80% to 70%<br>\n* Victor: Aura of Suffering radius reduced from 8m to 7.7m<br>\n* Victor: Aura of Suffering MinDPS, MaxDPS and spirit scaling increased by ~5-6%<br>\n* Victor: Jumpstart duration increased from 4s to 4.5s<br>\n* Victor: Shocking Reanimation radius increased from 12m to 13m</div>\n\t\t\t\t\n\t\t\t</div>\n\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t</article>\n\n\t\t\n\n\t\t\n\t</div>",
			"timestamp": "2025-10-05T11:05:47-0700"
		}
	]
}
