{
	"postId": "77465",
	"title": "10-24-2024 Update",
	"author": "Yoshi",
	"authorImage": "https://project8-data.community.forum/avatars/m/0/1.jpg?1713628630",
	"pubDate": "2024-10-24T12:39:08-0700",
	"content": "<div class=\"message-userContent lbContainer js-lbContainer \">\n\n\t\t\n\t\t\t\n\n\t\n\t\t\n\t\n\n\t\t\n\n\t\t<article>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\n\t\t\t<div>\n\t\t\t\t\n\t\t\t\t\t<div class=\"bbWrapper\">[ General Changes ]<br>\n<br>\n- Added 6 new heroes to Hero Labs, a new experimental hero matchmaking mode. The heroes are Holliday, Calico, Wrecker, Fathom, Viper and Magician (temp names). The goal of this mode is to invite players to help us in giving hero design feedback while heroes are in very early phases. Most heroes in this mode will have placeholder models, names, effects, etc (some exceptions are older in-dev heroes that had more developed art). They will also sometimes have placeholder/copy-paste abilities for certain slots if that ability slot is still TBD (such as Magician ultimate). There will be a specific hero labs section on the forum to post feedback on these. Heroes in this mode will often be removed, abilities changed, new heroes added, removed heroes re-added, etc. Patch notes for changes to heroes in this mode will be posted on the Hero Labs subforum. This mode will have limited testing hours for now while we gauge activity, in order to ensure faster queue times. You must have at least 50 games played to be able to queue here. If you don't get a new hero selected (since there are less new heroes than there are players), you will be considered higher priority for subsequent matches to get a new hero from your roster selection.<br>\n<br>\n- Added Commends. You can commend players you've enjoyed playing with during the game or in the post-game scoreboard (same places you would report).  The number of commends you've received on each hero will be displayed in your profile.<br>\n<br>\n- Added new character shader to improve player visibility in all areas of the map and experiment with more stylized rendering of character models<br>\n<br>\n<a href=\"https://forums.playdeadlock.com/attachments/lighting_changes-png.26027/\"><img src=\"https://project8-data.community.forum/attachments/26/26043-0a7f28f92179f3eb7fa034e749847461.jpg?hash=TFfcNYdH9K\" alt=\"lighting_changes.png\"></a><br>\n<br>\n- Updated environment lighting and sky<br>\n<br>\n- Added sequential kill streak music cues<br>\n<br>\n- Added keybinds for \"Fly Up\" and \"Fly Down\".  Used for flying abilities like Ivy's Air Drop and Vindicta's Flight<br>\n- Fixed being unable to report/mute disconnected players<br>\n<br>\n- You can now drag and drop build categories to move them around<br>\n- Added quick-selection for favorite builds. Clicking on the name of your currently active build in the shop will bring up a dropdown that lets you switch between favorited builds for that hero without opening the build browser.<br>\n<br>\n- Added indication of game mode within match history<br>\n- Added Rank badge to matches on the Watch page<br>\n- Added Rank History tab to profile, currently only visible for yourself. You can click on previous ranks to view the Rank Report summary for that interval<br>\n<br>\n- Flash Windows Taskbar icon if the game window isn't in focus and you have 3 seconds until you respawn<br>\n<br>\n- Fixed issue in several languages where team net worth number shrunk to an unreadable size<br>\n- Fixed Urns sometimes appearing to stay in the world after being picked up<br>\n- Fixed jittering from Lash's gun firing while running and aiming (this should reduce screen noise significantly in this case)<br>\n- Lash melee animation updates<br>\n- Added Melee Resistance to Vitality stat screen<br>\n- Lowered pitch of Haze voice processing<br>\n- Added teleporter channel and appear sounds<br>\n- Added Healing Rite end sound<br>\n- Added Mystic Shot proc sound<br>\n- Added Magic Carpet cast, cast delay, loop, and end sounds<br>\n- Updated Slowing Hex projectile loop, hit, and debuff sounds<br>\n- Yamato's Flying Strike now stops tracking targets that teleport<br>\n- Shiv's Killing Blow now stops tracking targets that teleport<br>\n- McGinnis melee animation updates<br>\n- Fixing hitting ESC to close to intro movie also closing the ranked summary popup<br>\n- Fixed pregame countdown drawing over the shop UI<br>\n- Pocket climb animation adjustments<br>\n- Mirage Traveler now previews Mirage's model at destination to show facing direction<br>\n- Lady Geist Life Drain revisions to show start of effect better but reduce noise afterwards<br>\n- Silenced debuff revisions to reduce obstructed vision of player<br>\n- Infernus Afterburn: debuff vfx reduced opacity after start to reduce noise<br>\n- Mirage Djinn's Mark: damage vfx revision to reduce visual noise, debuff moved to overhead UI<br>\n- Mirage gun revisions to tracer, muzzle flash, and impacts<br>\n- Shiv Dagger: reduced size of stuck dagger in victim<br>\n- Unstoppable vfx has a more obvious start<br>\n- Lady Geist Malice: revisions to reduce vfx noise and obstructions<br>\n<br>\n- Lady Geist Malice: reduced brightness of vfx for players close to it<br>\n- Shiv Slice and Dice: reduced vfx noise for players close to it<br>\n- Infernus: reduced darkness of players affected by Catalyst debuff<br>\n- Infernus: reduced brightness and lingering of Concussive Combustion effects<br>\n- Infernus: reduced visual noise of tracers and firerate increases<br>\n- Ivy Kudzu Bomb effects properly display visuals when above ground<br>\n- Lash Flog: new effects<br>\n- Viscous: cleaner effect for viscous alt-fire<br>\n- Rescue Beam: fixed some visual bugs on the effects<br>\n- Knockdown: updated effect animation to alert when it will stun<br>\n- Ammo Scavenger: proc sound only plays when applying a stack<br>\n- Play a sound when a debuff is applied to player but is purged due to some invulnerability<br>\n- Fixed instances where mix ducking occurs too early in a sound event's lifetime<br>\n- Fixed audio occlusion filtering artifacts during high rates of change<br>\n- Enabled certain music cues like 'respawn' to interrupt base attack music<br>\n- Denied orb sound will no longer play beyond 2500 game units from the player<br>\n- Reduced visual noise of Wraith's tracers when close up or when Wraith has a high fire rate<br>\n- Increased intelligibility of team-specific hero death sound<br>\n- Abandoning Co-op bot matches with more than one party now brings up the Abandon Match confirmation warning instead of leaving immediately<br>\n- Added looping telegraph for Seven Static Charge ability<br>\n- Added victim-specific sound for Static Charge the moment it is applied<br>\n- Bots are better at coming together to defend and push lanes<br>\n- Bots will prioritize assisting human allies on offense<br>\n- Reduced visual noise of Seven's tracers, especially when close up or when Seven has a high fire rate<br>\n<br>\n- Added a \"Mouse Sensitivity: Vertical Scaling\" setting<br>\n- Added a \"Reset Camera\" bind (available in Steam Input)<br>\n- Fixed Steam Input \"Melee\" Action not resetting the camera vertically<br>\n- Added new Steam Input Analog Action: \"Aim\". This uses Angle-based sensitivity options in Steam Input (work-in-progress feature).<br>\n- Fixed Steam Input aiming no longer being affected by Mouse Sensitivity options (including Invert Y)<br>\n- Fixed a bug where the last controller plugged in would block actions from other controllers. Now multiple controllers can be combined.<br>\n<br>\n<br>\n[ Misc Gameplay ]<br>\n<br>\n- AP is no longer granted for Walkers<br>\n- Shrine/Patron no longer have Soul/AP bounties<br>\n- Shrine Flex Slot moved to \"All Shrines\"<br>\n- Missing AP from above is redistributed along souls reward line at similar soul levels that the objectives previously died on average<br>\n<br>\n- Trooper Soul Orbs now have a 90ms buffer to allow the server to do better calculations on who shot the orb first, to minimize latency advantages for denying<br>\n- Trooper soul changed from 50/50% in the kill/orb to 60/40%<br>\n<br>\n- Breakables spawn time increased from 2 minutes to 3 minutes<br>\n- Breakables Souls reduced from 35 + 3/min to 30 + 2.5/min<br>\n<br>\n- Urn comeback properties now require an 8% net worth lead to kick in<br>\n- Urn pickup locations are the same as before, however now the drop-off locations will be variable based on which team is leading. If there isn't a lead over 8% net worth, then the drop-off location is the same as before. If there is, then the drop-off location will be closer to the losing team's side. The minimap will show where the drop-off location is as usual, as well as an indicator in the world that helps show you where it is.<br>\n<br>\n<a href=\"https://forums.playdeadlock.com/attachments/urn_01-png.26013/\"><img src=\"https://project8-data.community.forum/attachments/26/26029-316e26e32d5d9c28711b7b32c47c9ec2.jpg?hash=Bcy1Su9gev\" alt=\"urn_01.png\"></a><br>\n<a href=\"https://forums.playdeadlock.com/attachments/urn_02-png.26014/\"><img src=\"https://project8-data.community.forum/attachments/26/26030-66b9044d013d7baf5a1aa5a85be4cda7.jpg?hash=kSgwnPOjDr\" alt=\"urn_02.png\"></a><br>\n<a href=\"https://forums.playdeadlock.com/attachments/urn_03-png.26015/\"><img src=\"https://project8-data.community.forum/attachments/26/26031-964938f678db211578e57da87f872680.jpg?hash=u8rCtcD0c_\" alt=\"urn_03.png\"></a><br>\n<br>\n- If the Urn hasn't been delivered within 90 seconds of pickup time, it now drains your health for 1% of Max HP per second (the timer is per team). Your regen is disabled during this.<br>\n- Whenever the Urn is dropped after 90 seconds of pickup time, it starts moving back to its spawn point immediately and cannot be picked up by the same team for 12 seconds.<br>\n- Increased speed Urn walks back<br>\n<br>\n- Guardian attack range requirement changed from 20m to requiring you are above the ramp on high ground<br>\n- Guardian resist vs troopers changed from starting at 70% and ending at -30% at 10 min to starting at 60% and ending at -35% at 8 minutes<br>\n- Guardians now have resist vs players starting at 40% and ending at -35% at 8 minutes<br>\n<br>\n- Walkers now have resist vs troopers starting at 60% and ending at -30% at 14 minutes<br>\n- Walkers now have resist vs players starting at 60% and ending at -30% at 14 minutes<br>\n<br>\n- Troopers now gain +40% Spirit Resist gradually over 25 minutes, goes to 70% at 50 minutes<br>\n- Backdoor protection detection range for troopers increased (harder to kill troopers approaching the objectives with long range spells to stall making the game think you are backdooring when you aren't)<br>\n- Backdoor protection removal now has a 20s buffer (so it doesn't go into protection mode immediately once creeps die)<br>\n<br>\n- Mid Boss respawn timer decreases with subsequent boss kills, from 7 to 7/6/5 minutes<br>\n<br>\n- The 70s respawn time now happens at 30 min instead of 35 min<br>\n- There is now a respawn curve that goes from 70s to 75s over 30-&gt;40 minutes<br>\n<br>\n- Base Guardians and Shrines no longer have out-of-combat regen<br>\n<br>\n- Parry active window increased from 0.7 to 0.75<br>\n- Parry cooldown reduced from 5s to 4.5s<br>\n<br>\n- Medic Trooper heal now has 2 charges; time between casts is 6s [does not consume a charge when healing other troopers, mainly affects waves pushing on their own]<br>\n- Medic Trooper heal cooldown increased from 6s to 35s<br>\n- Sinner's Sacrifice now shares souls of subsequent hits with everyone that hit it recently (rather than the bigger value from last hit only going to one player)<br>\n<br>\n- Redesigned stairs from central canal to the outer lanes (near Urn spawn)<br>\n- Added a skybridge with interior from the Subway Entrance buildings into the Port Authority and Speakeasy buildings<br>\n<br>\n<a href=\"https://forums.playdeadlock.com/attachments/canal_update_102424-mp4.26017/\">View attachment canal_update_102424.mp4</a><br>\n<a href=\"https://forums.playdeadlock.com/attachments/canal-png.26018/\"><img src=\"https://project8-data.community.forum/attachments/26/26034-dadcc55de196610454a06ffd805d0234.jpg?hash=a48dE8_vh4\" alt=\"canal.png\"></a><br>\n<br>\n<br>\n- Connection hallways behind the Chapel and Firehouse now has an option to continue inside to the Walker arenas<br>\n- Added a Bounce Pad from these connection hallways to the front of the overpass<br>\n- Neutral camps beside Amber Purple and Sapphire Yellow Walker arenas moved from the ground floor to the upper floor<br>\n<br>\n<a href=\"https://forums.playdeadlock.com/attachments/purple_update_102424-mp4.26019/\">View attachment purple_update_102424.mp4</a><br>\n<a href=\"https://forums.playdeadlock.com/attachments/outer_lane_connection_102424-jpg.26020/\"><img src=\"https://project8-data.community.forum/attachments/26/26036-93a05dca9721d8ccbea072fb616bb646.jpg?hash=A8rfo7fvQ4\" alt=\"outer_lane_connection_102424.jpg\"></a><br>\n<br>\n<br>\n- Redesigned traversal from ground floor to upper floor of the Garage and Night Club to get to the Sinner's Sacrifice neutrals<br>\n- Replaced fire escape stairs with ropes on the exterior of the Garage and Night Club<br>\n<br>\n<a href=\"https://forums.playdeadlock.com/attachments/garage_nightclub_102424-mp4.26021/\">View attachment garage_nightclub_102424.mp4</a><br>\n<br>\n<br>\n- Added more zipline nodes to outer lanes<br>\n<br>\n<br>\n[ Weapon Items ]<br>\n<br>\n- Restorative Shot: Weapon Damage reduced from 7% to 6%<br>\n- Restorative Shot: Cooldown increased from 5.5s to 6s<br>\n- Rapid Rounds: Fire Rate increased from 9% to 10%<br>\n- Monster Rounds: Resist vs NPCs reduced from 30% to 25%<br>\n- High-Velocity Mag: Bullet Velocity reduced from 25% to 20%<br>\n- High-Velocity Mag: Bullet Shield Health increased from 50 to 65<br>\n- High-Velocity Mag: Weapon damage increased from 12% to 13%<br>\n<br>\n- Melee Charge: Weapon Damage reduced from 15% to 12%<br>\n- Melee Charge: Health reduced from 100 to 75<br>\n- Long Range: No longer grants +25% Ammo<br>\n- Long Range: Now has -20% Reload Time<br>\n- Active Reload: No longer grants -20% Reload Time<br>\n- Active Reload: Now grants +18% Ammo<br>\n- Mystic Shot: Proc cannot miss due to evasion<br>\n- Mystic Shot: Cooldown increased from 5.25 to 5.75<br>\n<br>\n- Burst Fire: Now grants +20% Slow Resistance<br>\n- Sharpshooter: No longer grants +20% Ammo<br>\n- Sharpshooter: Now has -20% Reload Time<br>\n- Tesla Bullets: Proc cooldown can now be reduced by cooldown reduction<br>\n- Titanic Magazine: Now grants +12% Spirit Resist<br>\n- Titanic Magazine: No longer grants +18% Bullet Resist<br>\n- Titanic Magazine: Now grants +25% Melee Damage Resistance<br>\n<br>\n- Lucky Shot: Proc now pierces evasion<br>\n- Vampiric Burst: Health increased from 150 to 175<br>\n<br>\n<br>\n<br>\n[ Vitality Items ]<br>\n<br>\n- Extra Regen: No longer grants +25 Health<br>\n- Extra Stamina: Bonus Health increased from +25 to +35<br>\n- Extra Health: Now upgrades into Fortitude<br>\n<br>\n- Enduring Speed: Slow Resist reduced from 35% to 30%<br>\n- Reactive Barrier: Ammo increased from 15% to 20%<br>\n<br>\n- Majestic Leap: Cooldown increased from 26s to 45s<br>\n- Majestic Leap: Getting shot while in the air disables the drop-down ability<br>\n- Rescue Beam: Pull speed reduced by 20%<br>\n- Rescue Beam: Sprint reduced from +2 to +1<br>\n- Fortitude: Now upgrades from Extra Health<br>\n- Fortitude: Health increased from 325 to 365<br>\n- Fortitude: Restore delay reduced from 11s to 10s<br>\n- Fortitude: Weapon Damage increased from 25% to 27%<br>\n- Veil Walker: Bullet Shield increased from 200 to 250<br>\n- Veil Walker: Spirit Shield increased from 200 to 250<br>\n- Superior Stamina: Spirit Power increased from 8 to 12<br>\n<br>\n- Soul Rebirth: No longer grants +15% Cooldown Reduction<br>\n- Soul Rebirth: Cooldown increased from 212s to 240s<br>\n- Siphon Bullets: Max HP Steal Per Bullet increased from 50 to 55<br>\n- Leech: Now has 12% Cooldown Reduction<br>\n- Leech: No longer grants Spirit Power<br>\n- Phantom Strike: No longer grants 15% Bullet Resist<br>\n- Phantom Strike: Now grants +15% Spirit Resist<br>\n- Unstoppable: No longer grants +15% Spirit Resist<br>\n- Unstoppable: Now grants +15% Bullet Resist<br>\n- Unstoppable: No longer grants 1 Move Speed<br>\n- Colossus: Slow reduced from 35% to 30%<br>\n- Colossus: Slow radius reduced from 14m to 12m<br>\n<br>\n<br>\n<br>\n[ Spirit Items ]<br>\n<br>\n- Mystic Reach: Ability Range reduced from 18% to 15%<br>\n- Mystic Reach: Bullet Resist increased from 6% to 7%<br>\n- Ammo Scavenger: Duration increased from 30s to 35s<br>\n<br>\n- Slowing Hex: Slow reduced from 25% to 20%<br>\n- Improved Cooldown: Now grants +75 Spirit Shield<br>\n- Withering Whip: Projectile speed increased by 30%<br>\n- Cold Front now does double damage to NPC units<br>\n- Duration Extender: Ability Duration reduced from 16% to 14%<br>\n- Duration Extender: Now grants +8% Weapon Damage<br>\n- Bullet Resist Shredder: No longer grants +5% Bullet Resist<br>\n- Bullet Resist Shredder: Now grants +15% Melee damage resistance<br>\n<br>\n- Surge of Power: When the passive procs, you no longer get slowed when shooting (similar to Fleetfoot)<br>\n- Surge of Power: Movespeed reduced from +3 to +2<br>\n- Improved Reach: Non-Imbued Ability Range increased from 25% to 26%<br>\n- Improved Reach: Bullet Resist increased from 12% to 13%<br>\n- Mystic Slow: Slow reduced from 30% to 25%<br>\n- Mystic Slow: Health bonus increased from 100 to 140<br>\n- Improved Burst: Max HP Damage increased from 7% to 9%<br>\n- Improved Burst: Threshold damage increased from 125 to 200<br>\n- Superior Cooldown: Spirit Shield increased from 100 to 150<br>\n- Superior Duration: Non-Imbued duration increased from 26% to 27%<br>\n- Superior Duration: Imbued duration increased from 32% to 33%<br>\n- Ethereal Shift: Active no longer grants 14 spirit power or reloads<br>\n- Ethereal Shift: Active now grants +3 Movespeed for 5 seconds after returning<br>\n- Ethereal Shift: Active now grants +40% Spirit Resist for 5 seconds after returning<br>\n- Ethereal Shift: Now grants +6 Spirit Power<br>\n- Improved Spirit: Spirit Power increased from 28 to 30<br>\n<br>\n- Boundless Spirit: Spirit Power increased from 60 to 65<br>\n- Boundless Spirit: Weapon Power increased from 25% to 30%<br>\n- Escalating Exposure: Spirit Amp Per Stack reduced from 5% to 4%<br>\n- Mystic Reverb: Slow now only affects the primary target<br>\n- Mystic Reverb: Spirit Lifesteal, Spirit Resist, and Ability Range reduced from 15% to 14%<br>\n<br>\n<br>\n<br>\n[ Hero Changes ]<br>\n<br>\n- Abrams: Melee attack rate reduced by 15% (time between attacks)<br>\n- Abrams: Gun falloff damage starts at 20m instead of 22m<br>\n- Abrams: Fixed some cases where Shoulder Charge would do a 180/360 on spell cast<br>\n- Abrams: Fixed Shoulder Charge sliding against wall surfaces incorrectly<br>\n- Abrams: Fixed Seismic Impact sometimes getting stuck on objects<br>\n<br>\n- Bebop: Bullet damage growth increased from 0.29 to 0.33<br>\n- Bebop: No longer gains 1% Bullet Resist per boon<br>\n- Bebop: Now gains 1% Spirit Resist per boon<br>\n- Bebop: Sticky Bomb now loses 20% of your stacks on death (rounds up)<br>\n- Bebop: Hook now returns troopers 75% faster than normal<br>\n<br>\n- Grey Talon: Base regen increased from 2 to 2.5<br>\n- Grey Talon: Gun spirit scaling increased from 0.1 to 0.13<br>\n- Grey Talon: Movespeed now scales with Spirit Power again<br>\n- Grey Talon: Rain of Arrows strafe speed with stamina increased by 30%<br>\n<br>\n- Infernus: Afterburn T1 reduced from 30% to 25%<br>\n<br>\n- Ivy: Base bullet damage increased from 4.5 to 5<br>\n- Ivy: Bullet damage growth reduced from 0.39 to 0.36<br>\n- Ivy: Air Drop slow reduced from 35% to 30%<br>\n<br>\n- Kelvin: Arctic Beam slow reduced from 50% to 40%<br>\n- Kelvin: Frost Grenade T2 heal reduced from 145 to 125<br>\n- Kelvin: Fixed Frozen Shelter not freezing weakened patron<br>\n<br>\n- Lady Geist: Malice slow reduced from 20% to 15%<br>\n- Lady Geist: Malice debuff duration reduced from 13s to 9s<br>\n- Lady Geist: Malice Damage Amp reduced from 15% to 8%<br>\n- Lady Geist: Malice T2 now also increases damage amp by 7%<br>\n- Lady Geist: Malice no longer causes you to un-zoom on cast<br>\n<br>\n- McGinnis: Gun spin decay rate improved from 0.65 to 0.25<br>\n- McGinnis: Mini Turrets cooldown reduced from 24s to 18s<br>\n- McGinnis: Mini Turrets spirit resist increased from 60% to 80%<br>\n- McGinnis: Spectral Wall slow reduced from 25% to 20%<br>\n- McGinnis: Spectral Wall T1 damage amp reduced from 25% to 15%<br>\n- McGinnis: Heavy Barrage minimum range increased from 6m to 7m<br>\n- McGinnis: Heavy Barrage cooldown increased from 106s to 140s<br>\n- McGinnis: Heavy Barrage T2 cooldown improved from -47s to -50s<br>\n- McGinnis: Heavy Barrage T1 slow reduced from 35% to 30%<br>\n<br>\n- Mirage: Fire Scarabs T3 max health steal increased from +70 to +80<br>\n- Mirage: Djinn's Mark T3 cooldown between multipliers improved from -0.5s to -0.75s<br>\n- Mirage: Traveler Fire Rate increased from 20% to 30%<br>\n- Mirage: Traveler T2 cooldown reduction improved from -30s to -40s<br>\n- Mirage: Traveler T3 now grants Unstoppable for 3s on arrival<br>\n<br>\n- Mo &amp; Krill: Now has 20% Headshot Crit reduction<br>\n- Mo &amp; Krill: Burrow bullet and spirit resist now persist while spinning out of the burrow<br>\n<br>\n- Paradox: Pulse Grenade pulses are now expressed as a duration rather than a fixed pulse count (works with Duration Extender)<br>\n- Paradox: Pulse Grenade T1 changed from +1 Pulse to +0.8s Duration<br>\n- Paradox: Pulse Grenade T2 improved from -7.5s to -8s<br>\n- Paradox: Kinetic Carbine T2 improved from -9.5s Cooldown to -10s<br>\n- Paradox: Kinetic Carbine shots cannot miss due to evasion<br>\n- Paradox: Kinetic Carbine can now pierce breakables<br>\n- Paradox: Kinetic Carbine now does 15% more damage on a headshot<br>\n- Paradox: Kinetic Carbine sound level reduced a little bit<br>\n<br>\n- Seven: Lightning Ball cooldown increased from 23s to 26s<br>\n- Seven: Lightning Ball radius reduced from 4m to 3.5m<br>\n- Seven: Lightning Ball T2 slow reduced from 40% to 35%<br>\n- Seven: Movespeed reduced from 7.3 to 7.1<br>\n- Seven: Storm Cloud expand time reduced from 3s to 2s<br>\n- Seven: Storm Cloud range increased from 25m to 30m<br>\n<br>\n- Shiv: Base speed reduced from 7.3 to 7.0<br>\n- Shiv: Serrated Knives collision radius reduced by 20%<br>\n- Shiv: Bloodletting cooldown increased from 21s to 50s<br>\n- Shiv: Bloodletting T2 cd increased from -4.75s to -25s (final cd changed from 16.25s to 25s)<br>\n- Shiv: Bloodletting duration increased from 10s to 13s<br>\n- Shiv: Bloodletting Incoming Damage Deferred reduced from 30% to 22%<br>\n- Shiv: Bloodletting T1 changed to +8% Incoming Damage Deferred (was +5s duration)<br>\n- Shiv: Killing Blow range reduced from 20m to 13m<br>\n- Shiv: Killing Blow Rage buildup per heavy melee reduced from 3.5 to 2.75<br>\n- Shiv: Killing Blow Rage buffer duration reduced from 10s to 9s<br>\n- Shiv: Killing Blow Rage buildup vs creeps reduced by 50%<br>\n<br>\n- Vindicta: Gun cycle time improved from 0.26s to 0.22s<br>\n- Vindicta: Bullet damage growth per boon increased from 0.55 to 0.65<br>\n- Vindicta: Fire rate now scales with Spirit Power (0.14)<br>\n- Vindicta: Assassinate no longer splits to allies<br>\n- Vindicta: Flight duration increased from 8s to 12s<br>\n- Vindicta: Flight T2 duration increased from +6s to +8s<br>\n- Vindicta: Assassinate bullet radius increased from 3\" to 4\"<br>\n- Vindicta: Assassinate scope is now automatically canceled when Paradoxical Swap hits you<br>\n<br>\n- Viscous: Bullet damage reduced from 12 to 11<br>\n- Viscous: Bullet damage growth per boon increased from 0.86 to 0.9 (total from 24.04 to 23.6)<br>\n- Viscous: The Cube T2 moved to T3<br>\n- Viscous: The Cube T2 is now +35 HP regen<br>\n- Viscous: Splatter T2 reduced from +60 Damage to +50<br>\n- Viscous: Goo Ball Spirit Resist reduced from 70% to 60%<br>\n<br>\n- Warden: Alchemical Flask slow duration reduced from 6s to 3s<br>\n- Warden: Alchemical Flask weapon damage duration increased from 6s to 7s<br>\n- Warden: Binding Word escape time reduced from 2.9s to 2.8s<br>\n- Warden: Binding Word escape range increased from 18.5m to 19m<br>\n- Warden: Last Stand T3 now also grants you unstoppable during the 2s channel<br>\n<br>\n- Wraith: Card Trick base damage reduced from 80 to 70<br>\n- Wraith: Card Trick cooldown increased from 0.5s to 0.65s<br>\n- Wraith: Telekinesis cooldown increased from 95s to 100s<br>\n- Wraith: Telekinesis T1 cooldown improved from -28s to -30s<br>\n<br>\n- Yamato: Fixed being able to cast an ability while casting Flying Strike<br>\n- Yamato: Fixed Crimson Slash following in the direction of dash instead of cross hair<br>\n- Yamato: Shadow Transformation T1 changed to +20% Fire Rate<br>\n- Yamato: Shadow Transformation Cooldown reduced from 106s to 90s</div>\n\t\t\t\t\n\t\t\t</div>\n\n\t\t\t<div class=\"js-selectToQuoteEnd\">&nbsp;</div>\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t</article>\n\n\t\t\n\t\t\t\n\n\t\n\t\t\n\t\n\n\t\t\n\n\t\t\n\t\t\t\n\t\n\n\t\t\n\t</div>",
	"posterReplies": []
}
